#include <iostream>
using namespace std;
/*
//--------------------------------------------------------------
//	함수 오버로딩( 함수 중복정의 )
//	:	유사한 기능을 하는 함수 중복정의.
//	:	함수 이름은 같고 매개변수의 정보( 갯수, 타입 )가 다른 경우.
//--------------------------------------------------------------
void Sum() { cout << "result : nothing" << endl; }
void Sum(int a, int b) { cout << "result : " << a + b << endl; }
void Sum(float a, float b) { cout << "result : " << a + b << endl; }
//--------------------------------------------------------------
int main()
{
	Sum();
	Sum(3,4);
	Sum(1.0f,4.0f);
	return 0;
}
//--------------------------------------------------------------
*/


//--------------------------------------------------------------
//	매개변수 정보는 같고 반환값의 정보가 다른 경우...
//--------------------------------------------------------------
/*
void Sum() { cout << "result : nothing" << endl; }
int Sum() { cout << "result : 0" << endl; }
int main()
{
	Sum();
	return 0;
}
*/