#pragma once
#ifndef _PREDEF_H_
#define _PREDEF_H_

//-------------------------------------------------------------------------------------------
//-- Apply Engine & Client  --
//-------------------------------------------------------------------------------------------
#define		_ENGCLI_VS2003_VS2008_		//	VS2003 & VS2008 겸용함수작업.








//-------------------------------------------------------------------------------------------
//-- SAMPLE_1 --
//-------------------------------------------------------------------------------------------
//	DRAWPRIMITIVE 타입에 대한 테스트. 
//  참고 : http://gameprogrammer.tistory.com/7 
//#define		_SAMP_D3DPT_TEST_TRIANGLESTRIP_	//	버텍스 수 = 프리미티브 + 2	
//#define		_SAMP_D3DPT_TEST_LINESTRIP_		//	버텍스 수 = 프리미티브 + 1
//#define		_SAMP_D3DPT_TEST_TRIANGLEFAN_	//	버텍스 수 = 프리미티브 + 2
//#define		_SAMP_D3DPT_TEST_TRIANELIST_	//	버텍스 수 = 프리미티브 * 3
//#define		_SAMP_RENDER_TEAPOT_			//	랜더링 테스트용 주전자.
//#define		_SAMP_ALPHABLEND_TEST_			//	알파블렌딩 테스트
#define			_SAMP_RENDERTEST_					//	테스트용 렌더.
#define			_SAMP_ASEMODEL_RENDER_				//	ASE 모델 렌더링.




//-------------------------------------------------------------------------------------------
//-- ENGINE --
//-------------------------------------------------------------------------------------------
//#define		_ENG_TEST_UI_			//	테스트 UI.
//#define		_ENG_DRAWPT_			//	D3DPT_POINTLIST 함수 추가.
#define			_ENG_OBJECT_MGR_		//	오브젝트.




//-------------------------------------------------------------------------------------------
//-- SHADER STUDY --
//-------------------------------------------------------------------------------------------


//	http://3dapi.com/bs26_shader2/ - 1. HLSL 연습



#endif	//_PREDEF_H_