#include <stdio.h>

void main(){
	// 배열문제
	// 문제1. 방 다섯개짜리 배열을 만들고 원하는 정수 다섯개를 입력받아 배열에 저장시켜보자.
	// 문제2. 인덱스 두개를 입력받아, 그 해당 인덱스에 들어가있는 값을 교   환해보자.
	// 문제3. 아파트 관리비 정산하기
	//		  3층짜리 아파트에 1~5호까지 있는 아파트 입니다. (101호~305호)
	//		  각각의 관리비(임의로 넣어주세요)가 있고, 관리비를 출력하는 프로그램을 만들어보자.
	//		  1. 1층의 관리비 평균 구하기
	//		  2. 각 층의 관리비 평균 구하기
	//		  3. 각 호의 관리비 출력할 수 있는 기능(함수) 만들기
	//		  4. 아파트 전체의 관리비 평균 구하기
	//		  5. 각 호를 출력하면, 해당 호의 관리비 출력과 함께, 
	//			 아파트 평균 관리비와 비교하여 평균 이하인지 이상인지 출력해보세요.

	// 포인터문제
	// 문제4. int a = 10;을 포인터 변수를 통하여 값을 1000으로 바꿔보세요
	// 문제5. a = 10, b = 50 두수의 값을 포인터를 이용하여 바꿔보세요 
	// 문제6. 문제5번의 두수의 값을 swap함수를 이용하여 값을 바꿔보세요
	// 문제7. a = 10, b = 50, c = 25 세개의 숫자를 보내서 가장 큰값을 돌려주는 함수를 만들어보세요.(함수문제)
	// 문제8. int arr[3] = {10, 20, 30}; 이라는 배열이 있고, 
	//			포인터변수를 통하여 arr의 첫번째,두번째,세번째 요소를 각각 출력해보세요. 

	 
}