//======================================================
#pragma warning( disable : 4996 )
//======================================================
#include <stdio.h>
//======================================================
//*	1.	scanf 일반적인 용법
int main(void)
{
	int n1, n2;
	int res1;

	printf("첫번째 숫자 입력 : ");
	scanf("%d", &n1);

	printf("두번째 숫자 입력 : ");
	scanf("%d", &n2);

	res1 = n1 + n2;
	printf("%d + %d = %d\n", n1, n2, res1);
	
	return 0;
}
//*/
//======================================================


//======================================================
/*	2.	scanf 다중 입력
int main(void)
{
	int n1, n2, n3;
	int res1;

	printf("세개의 정수 입력 : ");
	scanf("%d %d %d", &n1, &n2, &n3);

	res1 = n1 + n2 + n3;
	printf("%d + %d + %d = %d\n", n1, n2, n3, res1);

	return 0;
}
//*/
//======================================================