#include <stdio.h>

void main(){
	// [for문]
	// 문제1. 구구단 수 하나 입력받아, 입력받은 구구단 출력하기
	// 문제2. 구구단 전체 출력하기
	// [while문]
	// 문제1. 1 ~ 10사이의 홀수만 출력
	// 문제2. 1 ~ 20 까지의 수 모두 더하기
	// 문제3. 숫자 5번 입력받고, 입력받을때마다 더해서 결과값 출력하기
	// 문제4. 카페 메뉴 입력받고 주문 받은 메뉴 모두 더해서 종료시 합계 출력하고 프로그램 종료.
	/*	*** 굿잡 카페 ***
		1. 샌드위치 : 7000원
		2. 화이트 모카라떼 : 5000원
		3. 카라멜 프라푸치노 : 6000원
		4. 아메리카노 : 2500원
		5. 종료
	*/
	// 문제5. 주문하는 프로그램 만들기
	//		1단계) 주문한 메뉴 합계 구해서 출력하기
	//		2단계) 가진돈에서 합계 뺀 나머지 돈 출력
	//		3단계) 돈이 모자르면 주문 못하게 하기(잔액부족메세지 출력하고, 반복문 밖으로 빠져나간다)
	//		*** 굿잡 반점 ***
	//		가진돈:100000원
	//		1.짜장면 5000원 2.짬뽕 8000원 3.탕수육 12000원 4.종료 
	
	// 문제6. ATM기계 만들어보기
	/*	*** 굿잡은행 ATM ***
			1. 입금
			2. 출금
			3. 송금
			4. 계좌 조회 
			5. 종료
	*/
}