#include <stdio.h>

void main(){
	int arr[5] = {0, 10, 20, 30, 40};

	// 문제1. 인덱스가 2인곳을 출력해보세요
	// 문제2. 인덱스를 입력받고 그 인덱스 요소의 값을 출력해보세요
	// 문제3. 값을 입력받고, 해당 인덱스번호를 출력해보세요
	// 문제4. 인덱스를 입력받고, 해당 인덱스를 제외하고 출력해보세요.
	// 문제5.(심화) 숫자 2를 입력받으면, 0을 오른쪽으로 이동시켜 보세요.
	//			예) {0, 10, 20, 30, 40};  2입력받으면 => {10, 0, 20, 30, 40};

	// 문제6. 인자에 숫자를 넣으면 짝수/홀수인지 출력하는 함수를 만들어보세요.
	// 문제7. 인자에 숫자를 넣으면 양수/음수인지 출력하는 함수를 만들어보세요.
	// 문제8. ATM기계 만들어보기
	//		  1) ATM기계 메뉴
				/*	*** 굿잡은행 ATM ***
						1. 입금
						2. 출금
						3. 송금
						4. 계좌 조회 
						5. 종료
				*/
	//		  2) 처음 시작할때, 아이디(숫자) 비밀번호(숫자) 확인하고, 맞으면 메뉴 보여주기(로그인 함수 만들기)
	//		  3) 메뉴 출력하고 원하는 메뉴 선택받고 서비스 사용 
	//		  4) 모든 서비스(5번제외)는 함수로 분리시켜서 만들기.  
}