#include <stdio.h>

void main(){

	//문제1. for문으로 0부터 21까지 3씩 증가하여 출력하기.
	//문제2. for문을 사용해서 10부터 0까지 역순으로 출력하기.
	//문제3. arr이란 이름으로 int형 5칸짜리 배열을 만들어서, 10,21,3,41,58을 저장하고 출력(for문이용)해보세요.
	//문제4. 위 문제3에서 만든 배열의 요소중에 홀수만 출력하기.
	//문제5. (심화)주사위 홀짝게임 : 코인을 걸고 주사위의 수가 홀수인지 짝수인지 알아맞추는게임. 맞추면 배팅한 코인*2 받기.
	//		 1) 게임시작할때, 내가 가진 코인을 입력한다.
	//		 2) "코인을 걸어주세요: " => 가진 코인중에 사용할 코인 입력.
	//		 3) 컴퓨터가 주사위돌리고, 홀수인지 짝수인지 묻기  => 맞추기
	//		 4) 홀수인지 짝수인지 맞추면 배팅한 코인의 두배를 돌려받고, 틀리면 배팅한 코인 잃고 게임종료.
	//문제5.레벨업) 가진코인이 없어질때까지 계속 반복되는 게임. 게임한번할때마다 종료할지 묻기. 
}