//======================================================
#pragma warning (disable : 4996)
#include <stdio.h>
//======================================================
/*
1.	매크로

	-	의미

		-	자주 사용하는 여러 개의 명령어를 묶어서 관리하기 편하게 만든 것.

			-	여러 번 해야 하는 일을 간단하게 수행하기 위하여 사용.

			-	문서 안의 같은 문자열을 한꺼번에 변경할 때도 사용.



	-	선언

		-	#define 매크로	매크로몸체.

		예)	#define PI	3.1415

		-	전처리기 작동시에 매크로의 몸체가 매크로로 치환됨.

	-	종류.

		-	매크로 상수

		-	매크로 함수

		-	조건부 컴파일용 매크로.
*/
//======================================================