#include <stdio.h>

void main(){

	//문제1) 1~99 사이의 숫자하나를 입력받고 "홀수", "짝수" 출력하기
	//문제2) 정수하나 입력받고 "음수"인지 "양수"인지 출력하세요
	//문제3) 정수 두개를 입력받고, 몫과 나머지 출력하기
	//문제4) 초를 입력받고, 시, 분, 초를 출력하세요
	//문제5) 0~100사이의 성적을 입력받고, 
	//			90~100점은 "A", 80~89점은 "B", 70~79점은 "C", 이하는 "F"
	//문제5-1) 90~93 == A-, 94~97 == A, 98~100 == A+, 
	//			80~83 == B-, .....
	//문제6) 화폐매수 구하기
	//		: 금액을 입력받고, 최소 매수를 구하여 출력하는 프로그램
	//		예) 67200원 입력, 
	//		출력: 5만원 1장, 1만원 1장, 5천원 1장, 1천원 2장, 5백원 0개, 1백원 2개.
	//문제7) 지하철 요금 계산
	//		1. 0정거장에서 5정거장 : 기본요금 : 600원
	//		2. 6정거장에서 10정거장 :  기본요금  : 700원
	//		3. 10정거장 이후 추가로 2정거장마다 50원씩 추가. 
	//		ex. 몇정거장을 이용하시나요? 13,  결과: 800원
	//		ex. 몇정거장을 이용하시나요? 8,	  결과: 700원
}