#include <stdio.h>

void main() {

	// 문제1. 길이가 5인 int형 배열을 선언하여 5개의 정수를 입력받고 대입하시오. 대입을 다 끝낸 후! 최소 값과 최대 값, 5개 정수들의 합을 구하시오.
	int arr[5];

}


// 문제2. char형 배열을 선언하과 동시에 "Good time"의 문자으로 초기화 하고 출력하시오.
// 문제3. 사용자로부터 영단어 하나를 입력받아 입력받은 영단어의 길이를 출력하시오. ex) Array라는 단어를 입력하면 5가 나와야 한다.
// 문제4. 사용자로부터 영단어 하나를 입력받아 char형 배열에 저장한다. 그리고 역순으로 출력하시오. ex) apple 입력 elppa 출력
// 문제5. 사용자로부터 영단어 하나를 입력받는다. 입력받아 해당 문자의 아스키 코드 값이 가장 큰 영문자를 출력하시오.
// 문제6. int형 변슈 num1과 num2를 선언과 동시에 각각 10 20 으로 초기화 하고, int형 포인터 변수 ptr1, ptr2를 선언하여 num1과 num2를 가리키게 하자.
//        1) ptr1과 ptr2를 이용하여 num1의 값은 10증가 num2의 값은 10 감소 시키시오.
//        2) ptr1과 ptr2를 이용하여 num1과 num2의 값을 바꾸시오.
// 문제7. 길이가 5인 int형 배열을 선언하고 1,2,3,4,5로 초기화 한 다음 배열의 첫번째 요소를 가리키는 포인터 변수를 선언하시오. 그리고 포인터 변수를 이용하여 배열의 값들을 2씩 증가 시키시오.
// 문제8. 변수 num에 임의의 값을 담고 num의 값을 제곱시키는 함수 하나를 생성하시오. 그리고 리턴 값이 없이 결과는 메인함수에서 출력하시오.
// 문제9. 변수 num1 num2 에 서로 다른 값을 담고 서로의 값을 교환하는 함수를 만드시오. 그리고 리턴 값이 없이 서로 바뀐 결과는 메인함수에서 출력하시오.

// 최종 테스트
// 1. 길이가 10인 배열을 선언하고 10개의 정수를 입력받아서 저장한다. 그리고 홀수만 출력하는 함수와 짝수만 출력하는 함수를 만들어서 각각 만든 함수내에서 결과를 출력하시오.
// 2. 길이가 10인 배열을 선언하고 10개의 정수를 입력받으시오. 단, 입력한 숫자가 홀수이면 배열앞에서 부터 저장하고 짝수라면 배열 끝에서 부터 저장하시오.
// 3. 길이가 5인 배열을 선언하고 5개의 정수를 입력 받은후 오름차순으로 정렬하여 출력하시오.

// 문제1. 가로길이가 9 세로길이가 3인 int형 2차 배열을 선언하고 구구단 2단 3단 4단을 2차배열에 작성하시오.
// 문제2. 행과 열이 5인 int형 2차 배열을 선언하고 첫번째줄부터 네번째줄에는 국어, 영어, 수학, 국사, 네과목의 총점을 입력하고 마지막 5번째 줄에는 첫번째부터 네번째까지의 합들을 저장하시오.
// 문제3. 길이가 5인 int형 배열을 선언하고 배열의 최대값고 최소값을 구하는 함수를 만드시오. 그리고 결과값은 리턴없이 메인에서 출력하시오.

// 전화번호 관리 프로그램을 작성해 보자.
// 구조체로 만들고 등록된 이름에 따라 메모리를 동적으로 할당하시오.
// 입력 이름과 전화번호의 삭제
// 삭제 이름을 입력하면 해당 정보 삭제
// 검색 이름을 입려갛면 해당 정보 출력 
// 전체출력 저장된 모든이름과 전화번호를 출력